# homework2
 # На столе лежат n монеток. Некоторые из них лежат вверх решкой,
# а некоторые – гербом. Определите минимальное число монеток, которые
# нужно перевернуть, чтобы все монетки были повернуты вверх одной и той
# же стороной. Выведите минимальное количество монет, которые нужно перевернуть

print ("Введите количество монеток:")
n = int(input())
list1 = []
m = 0
k = 0
print ("Введите мотенки (1-орел, 0-решка):")
for i in range (0,n):
    elements = int(input())
    list1.append(elements)
    if elements == 0:
        m+=1
    else:
        k+=1
print ("Минимальное количество монет:", min(m,k))

# Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. Петя помогает
# Кате по математике. Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя
# должна их отгадать. Для этого Петя делает две подсказки. Он называет сумму этих
# чисел S и их произведение P. Помогите Кате отгадать задуманные Петей числа.

print ("Введите сумму чисел:")
s = int(input())
print ("Введите произведение чисел:")
p = int(input())
x = 0
y = 0
for x in range(0,s):
    for y in range(0,p):
        if s == x + y and p == x * y:
            print (x,y)

# Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N.

print ("Введите число n:")
n = int(input())
k = 0
for i in range(1, n+1):
    while 2**k <= n:
        print(2 ** k)
        k+=1
